{
    "post": [
        {
            "id":0,
            "user":"u/ThrowRAdeaththreat",
            "title":"My [29F] husband [32M] of 3 years said something I can't move on from.",
            "body":"We have a job that requires us to wake up very early in the morning. We've been working a cubicle away for the past couple of years. That's how we met.\n\nHe usually wakes up before me and makes me breakfast. He's been doing this since we got married.\n\nHe's sweet and caring like that. He's also the funniest, genuine and friendly person I know. I love him and know that he loves me back. Our relationship has always been stable.\n\nNow I'm not sure.\n\nToday morning while we were having breakfast, he calmy asked me to kill him if I ever caught him cheating. I initially brushed it off as a joke and replied likewise.\n\nThen he said that he'd kill me if he found me cheating. And he would enjoy it.\n\nI didn't know how to react. I just got chills. He's never been like this and I can't imagine him saying things like this.\n\nAll day at work I've been thinking what I did wrong. Did he read my messages (none of us keep passwords) and find something off? Did he see me talking with someone inappropriately?\n\nI don't know.\n\nWhat should I say to him?"
        },

        {
            "id":1,
            "user":"u/ThrowRASea_Stage3608",
            "title":"My roommates are considering letting an underage girl (16f) move in with us.",
            "body":"Basically, I have three roommates and we're all guys between the ages of 22-24. We've been looking for a new roommate since our last one moved out, they're currently deciding if we should let a 16-year-old girl move in with us, I'm the only one who seems to think this is weird. My roommates say they don't care how old she is as long as she pays rent every month. The girl says she's \"emancipated\" but has no proof of it, I find this weird do so many reasons. Mainly because we're adults and she's a child and this could be considered kidnapping or something. Is this just me?"
        },

        {
            "id":2,
            "user":"u/ThrowRApickshared",
            "title":"My (28M) girlfriend (25F) Shared my private pictures with her friends",
            "body":"We have been dating for 8 months. It is a LDR relationship. we have a great relationship and . She wanted to introduce me to her friends and we had a zoom call. She made a joke which hinted that I was well endowed. Her friends laughed and one of them said I know. I was extremely uncomfortable.\n\nAfter the call, I talked to her about it and she said she had talked to them about it and I pressed a little and she confessed that a few of them may have seen a few pictures I had sent her because she had been drunk and she got the text at the bar.\n\nShe said I should get over it as I have nothing to embarrassed about and they were all jealous of her. It makes me want to puke. I just feel bad about myself. I don't want those to be shared. I think I may be insecure about this. I feel like she sees me as a piece of meat rather than her boyfriend. It is breaking my heart. She thinks that it was just one slip up and I don't know honestly? I just want to block her. How do I deal with this?\n\nTLDR : Girlfriend's friends saw a few of the pictures I send her. She thinks it is not a big deal but I feel really bad."
        },

        {
            "id":3,
            "user":"u/ThrowRADepressionSad",
            "title":"My Mom died 3 months and fallen into a deep depression. My girlfriend (30/F) of 4 years told me (28/M) to get over it and move on or she'll move on.",
            "body":"My Mom died of Covid back in April. She was my last parent left. My Father had died last year of Covid too. I've fallen into a deep depression and it's led to me being fired from my job and it feels like nobody cares.\n\nMy girlfriend lives with me and she was sympathetic at first but, now she's sick of me being depressed. She's just plain rude and told me \"Just get over it. Shit happens. Move on with your life or I'll move on without you\". I can't. I was particularly close to them and now they're gone. I just don't know what to do. I have nobody to talk too. My girlfriend is tired of hearing me cry; she doesn't remotely care because, I should have gotten over it months ago and im acting like a child. I can not even begin to understand her logic. It's just so fucked up.\n\nFunny, my Boss didn't offer any sympathy either. he just tells me \"Yeah man, sorry but, that's life and I have a business to run and you're performance is costing us money\".\n\nFunny how selfish people are. Is she right? Is she right that I'm being a child and should move on?"
        },

        {
            "id":4,
            "user":"u/throwra726262525252",
            "title":"Update on my post about founding out my [26M] girlfriend [25F] cheated on me behind my back",
            "body":"So I lost access to my original account and can't find my original post (which was a week ago) but to recap, me and my girlfriend had been together for 3 years and I thought they were great. However, I learned the harsh truth when i discovered messages on her cell phone (when she left her cellphone at home and was going to bring it to work) between her and a coworker confirming they were at least emotionally cheating if not physical.\n\nI decided to confront her after taking advice and she got angry at me for looking at her phone. I again asked her to ask me about the text message and she refuses. I told her she had 2 weeks to get her stuff out (only my name was on the lease) and she went into physically attacking me with threats to kill me. I had to lock myself in a room and call the cops (who arrested her).\n\nI am pressing charges for her assaulting me and am currently staying at my brother's house while she is taking her stuff back. I want to thank you all for this great advice and realizing it was a bullet dodged."
        },

        {
            "id":5,
            "user":"u/throwRAalexsfriend",
            "title":"I (17F) saw my best friends dad (30sM) \"with\" a girl (18F) who has been saying she's had a crush on him since she was 12...should I tell my best friend what I saw or keep my mouth shut??",
            "body":"Hey everyone. So my best friend's name is Alex (we're both 17f). When we were younger (11-12ish) we had this friend named \"Lauren\". Alex has a really big house and a lot of cool stuff so about every week we would have a sleepover in her den. It would be me and her, lauren, and a few other girls. Lauren started saying that she had a crush on Alex's dad...which we all thought was weird but just kinda ignored...then it got weirder and she was saying that she wanted to have kids with him and everything so Alex finally talked to her and told her she thought the whole thing was weird and if she kept saying stuff like that she wasn't going to be able to come to her house anymore.\n\nLauren stopped and everything was fine for a while but then we just sort of naturally grew apart from Lauren, we were still friends with her and everything but she didn't really come over or anything. She'd still talk about Alex's dad, though, just not directly to Alex. At one point she said she had given him a bl*w job but he wasn't even in the country when she said it had happened (he had been on vacation with Alex and her sisters).\n\n\n\nAnyway yesterday my brother and I went to the mall kind of far away and I saw Lauren and Alex's dad and they were clearly together and were acting like really affectionate and everything. My brother told me that we need to keep our mouths shut about this because it's none of our business but I really don't see how I can't tell Alex about this?? even though I know she's going to tell her mom if I tell her, but shouldn't her mom know?? I feel like I'm betraying Alex if I don't tell her and if she finds out I knew without telling her it would end our friendship.\n\nedit to answer: yes he’s still married to Alex’s mom and no he’s not exactly 30 I said 30s Bc I don’t know exactly how old he is, my dad is 43 and I know her dad is a little younger.\n\nI have a pic of Alex’s dad and lauren together"
        },

        {
            "id":6,
            "user":"u/throwra_s32",
            "title":"My fiancé cheated on me",
            "body":"I've (32F) been with my fiancé (33M) for 5 years. We were supposed to get married last August, but made the tough decision to postpone our big day until August of 2022 because a lot of our older family members had expressed concerns with flying and being around a crowd of people.\n\nI met him at work, we are both hair stylists at a higher end salon. It's not a really creative environment. Occasionally you'll get someone who wants rainbow hair, but other than that it's very generic colors and cuts. Like 9 months ago, he told me he was feeling really depressed and stagnant at work and wanted to quit and work in a more creative environment. I supported him and he started working at a new salon within the month. Literally everyone who works there is in their early to mid 20's besides him.\n\nInstantly he was so much happier and within a few weeks he expressed his desire to start trying for a family and wanting me to come off the pill. I told him I though it would be better to wait a little while (preferably after the wedding) because he wasn't bringing in the same money he used to. Some of his clients followed him, but the majority didn't so his book/money was cut in half.\n\nHis birthday is in May and he brought up trying again and how he's in a good place at work and the timing is right. I agreed to come off BC not really trying or prevent it thinking it would take months to get pregnant. I get pregnant in June (20 weeks 4 days) and we're both excited for the next chapter of or lives together.\n\nJuly he changes his hours and starts working more and he tells me it's because he wants to be able to have money set aside for the baby because I won't be working for 6-8 weeks after birth. I don't think anything of it and think it's sweet he's trying to provide for the baby.\n\nTwo weeks ago he sits me down crying telling me he fucked up. I'm thinking he got fired. He cheated on me with his 20 year old apprentice/stylist under him. I was in complete shock. because this is what he wanted. He told me it's been going on since he found out I was pregnant because all of a sudden things he thought about just got really real and he couldn't handle it. I told him I couldn't deal with all this now and he needed to get out and stay with friends or family.\n\nHe's been calling and texting me non-stop and apologizing. Wanting to work on things, but he won't quit. I don't trust him and don't think I can unless he leaves his jobs and isn't around her all the time. I've talked to my therapist about this and I really don't know what the right answer is here. I'm not pissed, I'm hurt. He's going to be in my life forever one way or another. I told him I'm 99% sure this is something I can't get over. I'm really trying my hardest to stay calm for the babies sake because I know stress isn't good and can lead to issues.\n\nAny advice would be great?? Him not being involved is not an option. I would never be that cruel. He'll be a great father. He's so good with kids.\n\nTL;DR: My fiancé cheated on me with a stylist working under him and he refuses to quit, but wants to work on things."
        }
    ]
}